package com.example.mytrainingsession

class ExersiceDataBase {
    companion object{
        val  exercises = mutableListOf(
            Exercise(
                "Присед с махом ногой по диагонали",
                "Расставьте стопы на расстояние чуть шире плеч, как при классическом приседе. Выпрямитесь, опустите руки вдоль тела. Сделайте приседание, сцепив ладони в замок на уровне груди. Встаньте обратно и выполните мах перед собой прямой правой ногой в левом направлении. Опять присядьте и повторите мах, но уже вправо. С помощью этого упражнения вы прокачаете низ тела с упором на внутреннюю сторону бедра и ягодицы.",
                "10-12 приседаний (5-6 махов на каждую сторону), повторите в 2 подхода",
                R.drawable.gif1
            ),
            Exercise(
                "Боковой выпад на месте",
                "Отодвиньте стопы подальше друг от друга, носки разверните чуть в стороны, руки сложите на уровне груди, корпус держите ровным. Перенесите массу тела влево, опустите таз в выпад, вернитесь в исходную позу. Целый подход выполняйте на одну сторону. Затем смените ногу. Одно из лучших упражнений для похудения внутренней и внешней части бедра, так как задействуются приводящие мышцы и ягодицы.",
                "10-12 выпадов, повторите в 2 подхода, затем выполните на другую сторону",
                R.drawable.gif2
            ),
            Exercise(
                "Мах прямой ногой в сторону стоя",
                "Встаньте ровно, удалите стопы друг от друга на ширину плеч и соедините кисти на уровне груди, разведя локти четко в стороны. Слегка наклонитесь влево, при этом оставайтесь в устойчивом положении. Сделайте амплитудный мах вбок правой ногой, не сгибая ее в колене, насколько позволяет растяжка. Выполните подход сначала на одну ногу, потом на другую. Получают нагрузку внутренние и внешние зоны бедер, что стимулирует жиросжигание.",
                "10-12 махов, повторите в 2 подхода, затем выполните на другую сторону",
                R.drawable.gif3
            ),
            Exercise(
                "Быстрые вращения рук",
                "Поставьте стопы на ширину плеч, встаньте ровно, подсогните слегка коленки. Руки вытяните четко в стороны, держите на одной линии. Этим завершается исходная позиция. Затем начните быстро вращать руками вперед, с короткой амплитудой. Смотрите вперед, корпусом и ногами не помогайте.",
                "20-25 вращений в одну сторону, затем 20-25 вращений в другую сторону",
                R.drawable.gif4
            ),
            Exercise(
                "Проходка в планку",
                "Примите положение классической стойки – руки вдоль тела, а стопы на ширине плеч, спина прямая. Наклонитесь, немного согнув коленки, на пол перед носками опустите ладони, начните переставлять руки вперед, пока не дойдете до планки. Вернитесь этим же путем назад, выпрямитесь, повторите.",
                "8-10 повторений",
                R.drawable.gif5
            ),
            Exercise(
                "Подъемы рук над головой",
                "Расположитесь в классической стойке. Спина прямая, а стопы на ширине плеч, взгляд вперед. Поднимите руки над головой, затем опустите до положения как в жиме – локти напротив плеч. Начните делать довольно быстро подъемы, соединяя в верхней точке ладони. Руки до конца не выпрямляйте.",
                "20-25 повторений",
                R.drawable.gif6
            ),
            Exercise(
                "Касания плеч в планке",
                "Работа ведется в позиции упора лежа – планки на руках. Техника интуитивно проста: не меняя положения, вам необходимо поочередно касаться ладонями плеч противоположной стороны. При всем этом тело не должно перекашиваться, находясь в статичном положении. Если вы хотите упростить упражнение, то выполняйте касания плеч в планке на коленях.",
                "10-12 повторений на каждую руку. Повторить в два подхода",
                R.drawable.gif7
            ),
            Exercise(
                "Ножницы на локтях",
                "Если классические ножницы выполняются по горизонтальной траектории, то данная вариация — по вертикальной. Сядьте на коврик и облокотитесь на локти. Ноги при этом оторвите на 15-20 см от пола, после чего работайте ими, будто плывете на спине. Почувствуйте напряжение в брюшной области и поддерживайте его на протяжении всей работы.",
                "20-25 разведений ног. Повторить в два подхода",
                R.drawable.gif8
            ),
            Exercise(
                "Косые скручивания",
                "Для начала вам необходимо лечь на спину, свести руки за головой и согнуть ноги в коленях. Локти разверните в разные стороны. После этого выполните подъем корпуса со скручиванием, одновременно поднимая колено противоположной стороны. Локоть и колено должны стыковаться на уровне солнечного сплетения. Вернитесь в исходное положение и повторите движение снова, сменив сторону.",
                "по 10-12 повторений на каждую сторону. Повторить по два подхода",
                R.drawable.gif9
            ),
            Exercise(
                "Подъем корпуса с отведением рук",
                "Лягте на живот и выпрямите тело вдоль. Руки вытяните вперед, после чего поднимите корпус на 10-15 см от пола, полагаясь исключительно на силу поясничного отдела. После этого подведите руки через боковые стороны к бедрам, сделайте маленькую паузу и вернитесь в исходную позицию.",
                "10-12 повторений. Повторить в два подхода",
                R.drawable.gif10
            )
        )
    }
}